InformationRegisters/ИзмененияРеквизитовОбъектовИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияРеквизитовОбъектовИБ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтароеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДействияПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеПроверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_СписаниеТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВозвратГПВПереработку</v8:Type>
						<v8:Type>cfg:DocumentRef.БП_Оповещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаИзменениеУсловийКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетнаяОперация</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗакрытиеОстатков</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыплатаЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ДвижениеДС</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПереводТМЦ</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетПродажНовый</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредставительскиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Реализация</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыеДвижения</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаТорговлю</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Начисления903</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Сторно</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.РасходыБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_НачислениеЗП</v8:Type>
						<v8:Type>cfg:CatalogRef.Учредители</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоходыБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_НЗВ</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ЗакрытиеПериода</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_РасчетПроцентов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПеремещениеМатериаловВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_КорректировкаДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Д_МаршрутыЗаявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетПрочихПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВзаимозачетыПредприятий</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Возврат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Операция</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркетинговоеМероприятие</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПереоценкаВалютныхОстатков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбъектыДляРегистрацииИзмененийИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыДляРегистрацииИзмененийИБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Регистрировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияРеквизитовОбъектовИБ/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура НастроитьОбъектыдляРегистрации(Команда)

	ОткрытьФорму("РегистрСведений.ОбъектыДляРегистрацииИзмененийИБ.Форма.ФормаНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура АрхивацияУдаление(Команда)
	
	ОткрытьФорму("РегистрСведений.ИзмененияРеквизитовОбъектовИБ.Форма.ФормаАрхивацииИУдаления");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	ПользовательскийОтбор.Элементы.Очистить();
	
	//ПользовательскийПорядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Порядок.ИдентификаторПользовательскойНастройки);
	//ПользовательскийПорядок.Элементы.Очистить();
	//ЭлементПорядка = ПользовательскийПорядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	//ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Период");
	//ЭлементПорядка.Использование = Истина;
	
	Если Параметры.Свойство("Объект") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Объект", Параметры.Объект);
		СписокГруппировка.Параметры.УстановитьЗначениеПараметра("Объект", Параметры.Объект);
		Заголовок = "История изменений: " + Строка(Параметры.Объект);
		АвтоЗаголовок = Ложь;
		ОбъектСсылка = Параметры.Объект;
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Объект", Неопределено);
		СписокГруппировка.Параметры.УстановитьЗначениеПараметра("Объект", Неопределено);
	КонецЕсли;
	
	Элементы.СписокГруппировка.Видимость = ЗначениеЗаполнено(ОбъектСсылка);

	//Элементы.Список.Видимость = Ложь;
	//Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Очистить();
	//ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	//ПользовательскийОтбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПользовательскийПорядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Порядок.ИдентификаторПользовательскойНастройки);
	//ПользовательскийПорядок.Элементы.Очистить();
	//ЭлементПорядка = ПользовательскийПорядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	//ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Период");
	//ЭлементПорядка.Использование = Истина;

	//ПодключитьОбработчикОжидания("ОтобразитьСписок",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСписок()
	//Элементы.Список.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокГруппировкаПриАктивизацииСтроки(Элемент)
	Список.Отбор.Элементы.Очистить();
	Если Элементы.СписокГруппировка.ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ДанныеСтроки = Элементы.СписокГруппировка.ДанныеСтроки(Элементы.СписокГруппировка.ТекущаяСтрока);
	Если ДанныеСтроки.Пользователь = "Все пользователи" Тогда
		Возврат;	
	КонецЕсли;
	НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = ДанныеСтроки.Объект;
	НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Период");
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = ДанныеСтроки.Период;
	НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = ДанныеСтроки.Пользователь;
КонецПроцедуры
